{
    "Boat Pose or Paripurna Navasana": {
        "description": "Boat Pose strengthens the core and improves balance. It tones abdominal muscles, strengthens hip flexors and quadriceps, and improves concentration. This pose resembles the shape of a boat with the body forming a V-shape.",
        "instructions": "Sit on the floor with legs extended. Lean back slightly onto your sitting bones and lift your legs off the floor, bringing shins parallel to the mat. Extend your arms forward parallel to the floor. For full pose, straighten legs and reach fingertips toward toes. Keep spine straight and chest open. Hold for 30-60 seconds while breathing deeply."
    },
    "Bound Angle Pose or Baddha Konasana": {
        "description": "Bound Angle Pose opens the hips and improves flexibility in the groin and inner thighs. Also known as Butterfly Pose, it stimulates abdominal organs and is particularly beneficial for women's reproductive health.",
        "instructions": "Sit with legs extended. Bend knees and bring soles of feet together, drawing heels close to pelvis. Hold feet with hands and gently allow knees to drop toward the floor. Keep spine straight and chest open. For deeper stretch, gently fold forward from the hips. Hold for 30-60 seconds while breathing deeply."
    },
    "Bridge Pose or Setu Bandha Sarvangasana": {
        "description": "Bridge Pose is a gentle backbend that strengthens the back muscles, stretches the chest and hip flexors, and improves spinal flexibility. It can be energizing, rejuvenating, or restorative depending on how it's practiced.",
        "instructions": "Lie on your back with knees bent and feet hip-distance apart, close to your glutes. Press feet firmly into the floor and lift hips up, creating a straight line from knees to shoulders. Clasp hands under your back and press forearms down. Keep knees parallel and breathe deeply. Hold for 30-60 seconds, then slowly lower down."
    },
    "Camel Pose or Ustrasana": {
        "description": "Camel Pose is an intermediate backbend that opens the heart chakra, stretches the entire front body, and improves spinal flexibility. It stimulates the thyroid gland and enhances respiratory function while building strength and courage.",
        "instructions": "Kneel with shins parallel and hips directly over knees. Place hands on lower back for support. Engage front body and slowly arch back, reaching for heels with hands. Keep hips moving forward and head in neutral position. If comfortable, gently drop head back. Hold for 15-30 seconds, then slowly return to kneeling position."
    },
    "Cat Cow Pose or Marjaryasana": {
        "description": "Cat Cow Pose is a gentle flowing sequence that improves spinal flexibility, relieves back tension, and promotes coordination between breath and movement. It warms up the spine and prepares the body for other yoga poses.",
        "instructions": "Start on hands and knees in tabletop position with wrists under shoulders and knees under hips. For Cow: Inhale, drop belly down, lift chest and tailbone up, creating gentle backbend. For Cat: Exhale, round spine toward ceiling, tuck chin to chest. Flow smoothly between poses, coordinating with breath. Repeat 5-10 times."
    },
    "Chair Pose or Utkatasana": {
        "description": "Chair Pose is a powerful standing pose that strengthens the legs, core, and arms while building stamina and determination. It improves balance and can build cardiovascular health and resilience.",
        "instructions": "Stand with feet hip-width apart. Inhale and raise arms overhead. Exhale and bend knees, sitting back as if sitting in an imaginary chair. Keep weight in heels and knees pointing forward. Lengthen spine and reach arms up. Hold for 30-60 seconds while breathing steadily, then straighten legs to release."
    },
    "Cobra Pose or Bhujangasana": {
        "description": "Cobra Pose is a gentle backbend that strengthens the spine and shoulders, opens the chest and lungs, and improves posture. It stimulates abdominal organs, reduces stress, and enhances spinal flexibility.",
        "instructions": "Lie face down with forehead on mat, legs extended. Place palms under shoulders, elbows close to body. Press pubic bone down and gently lift chest, using back muscles more than arms. Keep shoulders away from ears and elbows slightly bent. Lengthen through crown of head and hold for 15-30 seconds. Lower slowly and relax."
    },
    "Dolphin Plank Pose or Makara Adho Mukha Svanasana": {
        "description": "Dolphin Plank Pose is a forearm variation of plank that strengthens and tones the whole body, especially the core and arms. It relieves headaches, fatigue, and back pain while building upper body and core strength.",
        "instructions": "Start in plank pose, then lower forearms to floor with elbows under shoulders. Keep body in straight line from head to heels, engaging core and legs. Press forearms down and avoid letting hips sag or pike up. Breathe steadily and hold for 30-60 seconds. Release by lowering knees to floor."
    },
    "Downward-Facing Dog pose or Adho Mukha Svanasana": {
        "description": "Downward-Facing Dog is a foundational pose that strengthens the arms and legs while stretching the spine, hamstrings, and calves. It improves circulation, energizes the body, and calms the mind.",
        "instructions": "Start on hands and knees. Tuck toes under and lift hips up and back, straightening legs to form inverted V-shape. Press hands firmly into floor and reach sitting bones toward ceiling. Straighten legs as much as possible while keeping spine long. Relax head between arms and breathe deeply. Hold for 30-60 seconds."
    },
    "Extended Revolved Side Angle Pose or Utthita Parsvakonasana": {
        "description": "Extended Side Angle Pose strengthens the legs and stretches the side body, opening the chest and improving flexibility. It enhances balance, stimulates digestion, and builds strength throughout the entire body.",
        "instructions": "From Warrior II, lower front forearm to front thigh and extend top arm over head, creating long line from back heel to fingertips. Alternatively, place bottom hand on floor or block beside front foot. Keep front knee over ankle and back leg strong. Open chest toward ceiling and breathe deeply. Hold for 30-60 seconds, then repeat other side."
    },
    "Extended Revolved Triangle Pose or Utthita Trikonasana": {
        "description": "Triangle Pose strengthens the legs and stretches the sides of the body, improving flexibility and balance. It stimulates digestion, reduces back pain, and enhances concentration while opening the chest and shoulders.",
        "instructions": "Stand with feet 3-4 feet apart. Turn right foot out 90 degrees and left foot in slightly. Extend arms parallel to floor. Hinge at hip and reach right hand toward right foot, placing hand on shin, ankle, or floor. Extend left arm toward ceiling. Keep both sides of torso equally long and breathe deeply. Hold for 30-60 seconds, then repeat other side."
    },
    "Gate Pose or Parighasana": {
        "description": "Gate Pose stretches the side body and improves posture while strengthening the core and intercostal muscles. It counteracts the effects of prolonged sitting and promotes deep breathing by opening the rib cage.",
        "instructions": "Kneel on floor with knees hip-width apart. Extend right leg straight out to side with foot flat on floor. Place left hand on left hip and extend right arm up. Lean toward extended leg, sliding right hand down leg while reaching left arm over head. Keep chest open and avoid collapsing forward. Hold for 30-45 seconds, then repeat other side."
    },
    "Low Lunge pose or Anjaneyasana": {
        "description": "Low Lunge Pose stretches the hip flexors and quadriceps while strengthening the legs and improving balance. Named after Hanuman's mother Anjani, it opens the heart, enhances focus, and builds lower body flexibility.",
        "instructions": "From Downward Dog, step right foot forward between hands. Lower left knee to floor and slide it back until you feel comfortable stretch in left hip flexor. Keep right knee over ankle. Lift torso upright and sweep arms overhead. Gently arch back if comfortable. Hold for 30-60 seconds, then repeat other side."
    },
    "Plank Pose or Kumbhakasana": {
        "description": "Plank Pose builds core strength and stability while strengthening the arms, wrists, and spine. It improves posture, builds stamina, and tones the abdomen. The name means 'breath retention' as the pose requires steady breathing to maintain.",
        "instructions": "Start on hands and knees. Step feet back so body forms straight line from head to heels. Keep wrists under shoulders, engage core, and press through heels. Avoid sagging hips or lifting them too high. Breathe steadily and hold for 30-60 seconds or as long as comfortable. Lower knees to release."
    },
    "Sitting pose 1 (normal)": {
        "description": "Normal sitting pose is a comfortable cross-legged position that promotes relaxation, improves posture, and serves as a foundation for meditation and breathing exercises. It helps ground the mind and body while maintaining spinal alignment.",
        "instructions": "Sit cross-legged on the floor with each foot tucked under the opposite thigh. Rest hands comfortably on knees or thighs. Keep spine naturally erect without forcing. Relax shoulders and soften facial muscles. If hips are tight, sit on a cushion or blanket for comfort. Breathe naturally and hold for several minutes."
    },
    "Tree Pose or Vrksasana": {
        "description": "Tree Pose improves balance, focus, and concentration while strengthening the standing leg and opening the hips. It symbolizes the steady, grounded nature of a tree and promotes mental clarity and inner strength.",
        "instructions": "Stand tall in Mountain Pose. Shift weight to left foot and bend right knee. Place right foot on inner left thigh (avoid placing on knee). Press foot into leg and leg into foot. Bring hands to heart center or extend arms overhead. Fix gaze on steady point and breathe calmly. Hold for 30-60 seconds, then repeat other side."
    },
    "Virasana or Vajrasana": {
        "description": "Hero Pose (Virasana) and Thunderbolt Pose (Vajrasana) are kneeling poses that improve digestion, strengthen the thighs and ankles, and promote meditation. They help with posture, reduce fatigue, and calm the mind while stretching the quadriceps.",
        "instructions": "Kneel on floor with knees together and feet slightly wider than hips (Virasana) or knees and feet together (Vajrasana). Sit back between feet or on heels, keeping spine erect. Rest hands on thighs and relax shoulders. If uncomfortable, place cushion between calves and thighs. Breathe deeply and hold for 1-5 minutes."
    },
    "Warrior II Pose or Virabhadrasana II": {
        "description": "Warrior II Pose builds strength and stamina while improving focus and determination. Named after the fierce warrior Virabhadra, it strengthens the legs, opens the hips and chest, and promotes courage and concentration.",
        "instructions": "Stand with feet 3-4 feet apart. Turn right foot out 90 degrees and left foot in slightly. Bend right knee over ankle, keeping thigh parallel to floor. Extend arms parallel to floor and gaze over right fingertips. Keep torso upright and breath steady. Hold for 30-60 seconds, then straighten front leg and repeat other side."
    }
}